tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85j15_tdd.h
#define VCFG01                        1091
#define VCFG11                        1092
#define VCFG1                         1093
#define ADCON0                        1094
#define ADON                          1095
#define nDONE                         1096
#define GO_nDONE                      1097
#define NOT_DONE                      1098
#define GODONE                        1099
#define GO_DONE                       1100
#define DONE                          1101
#define GO_NOT_DONE                   1102
#define GO                            1103
#define CHS0                          1104
#define CHS                           1105
#define CHS1                          1106
#define CHS2                          1107
#define CHS3                          1108
#define ADCAL                         1109
#define SSP1CON2                      1110
#define SEN1                          1111
#define SSP1CON2_SEN                  1112
#define ADMSK11                       1113
#define SSP1CON2_RSEN                 1114
#define RSEN1                         1115
#define SSP1CON2_ADMSK1               1116
#define SSP1CON2_PEN                  1117
#define ADMSK21                       1118
#define PEN1                          1119
#define SSP1CON2_ADMSK2               1120
#define ADMSK31                       1121
#define RCEN1                         1122
#define SSP1CON2_RCEN                 1123
#define SSP1CON2_ADMSK3               1124
#define SSP1CON2_ACKEN                1125
#define ACKEN1                        1126
#define ADMSK41                       1127
#define SSP1CON2_ADMSK4               1128
#define ACKDT1                        1129
#define ADMSK51                       1130
#define SSP1CON2_ACKDT                1131
#define SSP1CON2_ADMSK5               1132
#define SSP1CON2_ACKSTAT              1133
#define ACKSTAT1                      1134
#define GCEN1                         1135
#define SSP1CON2_GCEN                 1136
#define SSP1CON1                      1137
#define SSP1CON1_SSPM0                1138
#define SSPM01                        1139
#define SSP1CON1_SSPM                 1140
#define SSP1CON1_SSPM1                1141
#define SSPM11                        1142
#define SSP1CON1_SSPM2                1143
#define SSPM21                        1144
#define SSPM31                        1145
#define SSP1CON1_SSPM3                1146
#define SSP1CON1_CKP                  1147
#define CKP1                          1148
#define SSPEN1                        1149
#define SSP1CON1_SSPEN                1150
#define SSPOV1                        1151
#define SSP1CON1_SSPOV                1152
#define WCOL1                         1153
#define SSP1CON1_WCOL                 1154
#define SSP1STAT                      1155
#define BF1                           1156
#define SSP1STAT_BF                   1157
#define UA1                           1158
#define SSP1STAT_UA                   1159
#define SSP1STAT_R_NOT_W              1160
#define RW1                           1161
#define NOT_W                         1162
#define SSP1STAT_R                    1163
#define SSP1STAT_nW                   1164
#define RW                            1165
#define SSP1STAT_READ_WRITE           1166
#define SSP1STAT_nWRITE               1167
#define SSP1STAT_I2C_READ             1168
#define SSP1STAT_R_W                  1169
#define SSP1STAT_NOT_WRITE            1170
#define SSP1STAT_R_nW                 1171
#define SSP1STAT_S                    1172
#define START                         1173
#define START1                        1174
#define SSP1STAT_I2C_START            1175
#define STOP                          1176
#define SSP1STAT_P                    1177
#define STOP1                         1178
#define SSP1STAT_I2C_STOP             1179
#define SSP1STAT_D                    1180
#define SSP1STAT_D_NOT_A              1181
#define NOT_A                         1182
#define SSP1STAT_D_A                  1183
#define SSP1STAT_D_nA                 1184
#define SSP1STAT_NOT_ADDRESS          1185
#define SSP1STAT_nA                   1186
#define DA1                           1187
#define DA                            1188
#define SSP1STAT_nADDRESS             1189
#define SSP1STAT_I2C_DAT              1190
#define SSP1STAT_DATA_ADDRESS         1191
#define SSP1STAT_CKE                  1192
#define CKE1                          1193
#define SSP1STAT_SMP                  1194
#define SMP1                          1195
#define SSP1ADD                       1196
#define MSK01                         1197
#define MSK0                          1198
#define MSK11                         1199
#define MSK1                          1200
#define MSK21                         1201
#define MSK2                          1202
#define MSK3                          1203
#define MSK31                         1204
#define MSK4                          1205
#define MSK41                         1206
#define MSK51                         1207
#define MSK5                          1208
#define MSK61                         1209
#define MSK6                          1210
#define MSK71                         1211
#define MSK7                          1212
#define T2CON                         1213
#define T2CKPS0                       1214
#define T2CKPS                        1215
#define T2CKPS1                       1216
#define TMR2ON                        1217
#define T2OUTPS0                      1218
#define TOUTPS                        1219
#define T2OUTPS1                      1220
#define T2OUTPS2                      1221
#define T2OUTPS3                      1222
#define T1CON                         1223
#define TMR1ON                        1224
#define TMR1CS                        1225
#define NOT_T1SYNC                    1226
#define T1SYNC                        1227
#define nT1SYNC                       1228
#define T1INSYNC                      1229
#define T1OSCEN                       1230
#define SOSCEN                        1231
#define T1CKPS0                       1232
#define T1CKPS                        1233
#define T1CKPS1                       1234
#define T1RUN                         1235
#define T1RD16                        1236
#define T1CON_RD16                    1237
#define RCON                          1238
#define BOR                           1239
#define NOT_BOR                       1240
#define nBOR                          1241
#define POR                           1242
#define nPOR                          1243
#define NOT_POR                       1244
#define nPD                           1245
#define NOT_PD                        1246
#define PD                            1247
#define NOT_TO                        1248
#define nTO                           1249
#define TO                            1250
#define nRI                           1251
#define NOT_RI                        1252
#define RI                            1253
#define IPEN                          1254
#define WDTCON                        1255
#define SWDTE                         1256
#define SWDTEN                        1257
#define OSCCON                        1258
#define SCS0                          1259
#define SCS                           1260
#define SCS1                          1261
#define OSTS                          1262
#define IDLEN                         1263
#define T0CON                         1264
#define T0PS                          1265
#define T0PS0                         1266
#define T0PS1                         1267
#define T0PS2                         1268
#define PSA                           1269
#define T0PS3                         1270
#define T0SE                          1271
#define T0CS                          1272
#define T08BIT                        1273
#define TMR0ON                        1274
#define STATUS                        1275
#define C                             1276
#define CARRY                         1277
#define DC                            1278
#define ZERO                          1279
#define Z                             1280
#define OV                            1281
#define OVERFLOW                      1282
#define N                             1283
#define NEGATIVE                      1284
#define INTCON3                       1285
#define INT1IF                        1286
#define INT1F                         1287
#define INT2IF                        1288
#define INT2F                         1289
#define INT3F                         1290
#define INT3IF                        1291
#define INT1E                         1292
#define INT1IE                        1293
#define INT2IE                        1294
#define INT2E                         1295
#define INT3E                         1296
#define INT3IE                        1297
#define INT1P                         1298
#define INT1IP                        1299
#define INT2IP                        1300
#define INT2P                         1301
#define INTCON2                       1302
#define RBIP                          1303
#define INT3IP                        1304
#define INT3P                         1305
#define TMR0IP                        1306
#define T0IP                          1307
#define INTEDG3                       1308
#define INTEDG2                       1309
#define INTEDG1                       1310
#define INTEDG0                       1311
#define RBPU                          1312
#define NOT_RBPU                      1313
#define nRBPU                         1314
#define INTCON                        1315
#define RBIF                          1316
#define INT0F                         1317
#define INT0IF                        1318
#define T0IF                          1319
#define TMR0IF                        1320
#define RBIE                          1321
#define INT0E                         1322
#define INT0IE                        1323
#define T0IE                          1324
#define TMR0IE                        1325
#define PEIE                          1326
#define PEIE_GIEL                     1327
#define GIEL                          1328
#define GIE_GIEH                      1329
#define GIE                           1330
#define GIEH                          1331
#define STKPTR0                       1332
#define STKPTR                        1333
#define SP0                           1334
#define STKPTR1                       1335
#define SP1                           1336
#define STKPTR2                       1337
#define SP2                           1338
#define SP3                           1339
#define STKPTR3                       1340
#define STKPTR4                       1341
#define SP4                           1342
#define STKUNF                        1343
#define STKOVF                        1344
#define STKFUL                        1345

#endif // _PIC18F85J15_H_
